Repository: mbussolotto/uyuni-tools
Catalog: locale/mgradm/*.po
Languages: ca

source: Uyuni administration tool
ca: Eina d'administració Uyuni

source: Tool to help administering Uyuni servers in containers
ca: Eina per a ajudar a administrar servidors Uyuni en contenidors

source: Server Deployment:
ca: Desplegament del servidor:

source: Server Management:
ca: Gestió del servidor:

source: Administrator tools:
ca: Eines de l'administrador:

source: Welcome to %s
ca: Us donem la benvinguda a %s

source: Executing command: %s
ca: S'està executant l'ordre: %s

source: configuration file path
ca: camí del fitxer de configuració

source: application log level
ca: nivell de registre de l'aplicació

source: Unable to unmount ISO image, leaving %s intact
ca: No s'ha pogut desmuntar la imatge ISO, deixant %s intacte

source: unable to login and register the distribution. Manual distro registration is required
ca: no s'ha pogut iniciar la sessió i registrar la distribució. Es requereix un registre de distribució manual

source: unable to register the distribution. Manual distro registration is required
ca: no s'ha pogut registrar la distribució. Es requereix un registre de distribució manual

source: Distribution %s successfully registered
ca: La distribució %s s'ha registrat correctament

source: source %s does not exists
ca: la font %s no existeix

source: unable to mount ISO image: %s
ca: no s'ha pogut muntar la imatge ISO: %s

source: Missing TreeLabel. Please specify distribution name
ca: Falta l'etiqueta de l'arbre. Especifiqueu el nom de la distribució

source: distribution with same name already exists: %s
ca: ja existeix una distribució amb el mateix nom: %s

source: cannot create %s path in container
ca: no s'ha pogut crear el camí %s al contenidor

source: Copying distribution %s
ca: S'està copiant la distribució %s

source: cannot copy %s
ca: no es pot copiar %s

source: Distribution has been copied into %s
ca: La distribució s'ha copiat a %s

source: Auto-detected distribution %s
ca: Distribució detectada automàticament %s

source: Continue by registering autoinstallation distribution
ca: Continua registrant la distribució d'instal·lació automàtica

source: distribution not found in product map. Please update productmap or provide channel label
ca: no s'ha trobat la distribució en el mapa del producte. Actualitzeu el mapa de producte o proporcioneu l'etiqueta del canal

source: unable to read distribution treeinfo. Please provide distribution details and/or channel label
ca: no s'ha pogut llegir la informació de l'arbre de la distribució. Si us plau, proporcioneu detalls de distribució i/o etiqueta de canal

source: distribution treeinfo %s does not exists. Please provide distribution details and/or channel label
ca: la informació d'arbre de distribució %s no existeix. Si us plau, proporcioneu detalls de distribució i/o etiqueta de canal

source: Auto installation distribution product mapping. For distribution to be registered by the server it is important to map distribution to the correct software channel. Software channels can be named differently without any corellation to distribution name; it is then needed to allow custom distribution name to software channel mapping. One way to set software channel is by flag --channel to the distribution copy command. For frequent usage it is possible to write custom product mapping to the mgradm configuration file as follows: ProductMap: <distribution name>: <distribution version>: <distribution architecture>: ChannelLabel: <channel label> InstallType: <one of rhel_7|rhel_8|rhel_9|sles12generic|sles15generic|generic_rpm> TreeName: <custom distribution name> Where * <distribution name> is the name of the distribution, by default taken from '.treeinfo' file from the media. If '.treeinfo' is not found or available, command line option is required and used. * <distribution version> is the version of the distribution, by default taken from '.treeinfo' file from the media. If'.treeinfo' is not found, command line option is required and used. * <distribution architecture> is distribution architecture, by default taken from '.treeinfo' file from the media. If '.treeinfo' is not found, command line option is required and used. * ChannelLabel is the channel label from Uyuni server and which is to be used for this distribution; can be overridden by command line flag. * InstallType is used when installer is known (for autoyast or kickstart) or use 'generic_rpm'. * TreeName is how the distribution will be presented in the Uyuni server UI. If not set <distribution name> is used. Build-in product map: {{ .DefaultProductMap }}
ca: Assignació automàtica de productes de distribució d'instal·lació. Per tal que la distribució sigui registrada pel servidor és important assignar la distribució al canal de programari correcte. Els canals de programari es poden anomenar de manera diferent sense cap corellació al nom de la distribució; Llavors es necessita per permetre el nom de distribució personalitzada al mapatge de canals de programari. Una manera d'establir el canal de programari és mitjançant l'indicador --channel a l'ordre de còpia de distribució. Per a un ús freqüent, és possible escriure un mapatge personalitzat del producte al fitxer de configuració de mgradm de la següent manera: Mapa de producte: <distribution name>: <distribution version>: <distribution architecture>: Etiqueta del canal: <channel label> Tipusinstal·lació: <one of rhel7|rhel8|rhel9|sles12generic|sles15generic|genericrpm> Nom de l'arbre: <custom distribution name> On * <distribution name> és el nom de la distribució, per defecte agafat del fitxer '.treeinfo' del suport. Si no es troba o està disponible '.treeinfo', es requereix i s'utilitza l'opció de línia d'ordres. * <distribution version> és la versió de la distribució, per defecte agafada del fitxer '.treeinfo' del suport. Si no es troba «.treeinfo», es requereix i s'utilitza l'opció de línia d'ordres. * <distribution architecture> és una arquitectura de distribució, per defecte extreta del fitxer '.treeinfo' del mitjà. Si no es troba «.treeinfo», es requereix i s'utilitza l'opció de línia d'ordres. * ChannelLabel és l'etiqueta del canal del servidor Uyuni i que s'utilitzarà per a aquesta distribució; es pot substituir per l'indicador de la línia d'ordres. * InstallType s'utilitza quan es coneix l'instal·lador (per a l'autoyast o kickstart) o utilitza 'genericrpm'. * TreeName és com es presentarà la distribució a la interfície d'usuari del servidor Uyuni. Si no s'estableix, s'utilitza <distribution name>. Mapa del producte en muntatge: {{ .Mapa de producte predeterminat }}

source: Distributions management
ca: Gestió de distribucions

source: Tools for autoinstallation distributions management
ca: Eines per a la gestió de distribucions d'instal·lació automàtica

source: Copy distribution files from iso to the container
ca: Copia els fitxers de distribució de l'ISO al contenidor

source: Takes a path to source iso file or directory with mounted iso and copies it into the container. Optional parameters 'distribution-name', 'version' and 'arch' specifies custom distribution. If not set, distribution name is attempted to be autodetected: - use name from '.treeinfo' file if exists - use name of the ISO or passed directory Note: API details are required for auto registration.
ca: Agafa un camí cap al fitxer o directori iso d'origen amb iso muntat i el copia al contenidor. Els paràmetres opcionals «distribution-name», «version» i «arch» especifica una distribució personalitzada. Si no s'estableix, s'intenta detectar automàticament el nom de la distribució: - utilitza el nom del fitxer '.treeinfo' si existeix - utilitza el nom de l'ISO o del directori passat Nota: els detalls de l'API són necessaris per al registre automàtic.

source: Set parent channel for the distribution.
ca: Estableix el canal pare per a la distribució.

source: Help on using custom distribution product map
ca: Ajuda en l'ús d'un mapa de productes de distribució personalitzada

source: failed to compute config help command
ca: no s'ha pogut calcular l'ordre d'ajuda de configuració

source: Add GPG keys for 3rd party repositories
ca: Afegeix claus GPG per als repositoris de tercers

source: Import without asking confirmation
ca: Importa sense demanar confirmació

source: failed to create folder %s
ca: no s'ha pogut crear la carpeta %s

source: failed to create keyring %s
ca: no s'ha pogut crear l'anell de claus %s

source: failed to parse %s
ca: no s'ha pogut analitzar %s

source: failed to download %s
ca: no s'ha pogut baixar %s

source: failed to show key %s
ca: no s'ha pogut mostrar la clau %s

source: Do you really want to trust this key
ca: Segur que voleu confiar en aquesta clau

source: failed to copy %[1]s to %[2]s
ca: no s'ha pogut copiar %[1]s a %[2]s

source: Running %s
ca: S'està executant %s

source: failed to run import key
ca: no s'ha pogut executar la clau d'importació

source: failed to restart uyuni-update-config
ca: no s'ha pogut reiniciar uyuni-update-config

source: Manage GPG keys for 3rd party repositories
ca: Gestiona les claus GPG per als repositoris de tercers

source: Hub management
ca: Gestió de Hub

source: Tools and utilities for Hub management
ca: Eines i utilitats per a la gestió de Hub

source: Register
ca: Registra

source: Register this peripheral server to Hub API
ca: Registra aquest servidor perifèric a l'API del Hub

source: invalid line format: %s
ca: el format de línia no és vàlid: %s

source: mandatory %s entry missing in config
ca: falta l'entrada obligatòria %s a la configuració

source: Hub API server: %s
ca: Servidor API del Hub: %s

source: failed to connect to the Hub server
ca: no s'ha pogut connectar al servidor Hub

source: failed to register this peripheral server
ca: no s'ha pogut registrar aquest servidor perifèric

source: failed to register this peripheral server: %s
ca: no s'ha pogut registrar aquest servidor perifèric: %s

source: failed to update peripheral server info
ca: no s'ha pogut actualitzar la informació del servidor perifèric

source: failed to update peripheral server info: %s
ca: no s'ha pogut actualitzar la informació del servidor perifèric: %s

source: Registered peripheral server: %[1]s, ID: %[2]d
ca: Servidor perifèric registrat: %[1]s, ID: %[2]d

source: Inspect
ca: Inspecciona

source: Extract information from image and deployment
ca: Extreu informació de la imatge i el desplegament

source: failed to determine image
ca: no s'ha pogut determinar la imatge

source: failed to find the image of the currently running server container: %s
ca: no s'ha pogut trobar la imatge del contenidor del servidor actualment en execució: %s

source: failed retrieving namespace
ca: no s'ha pogut recuperar l'espai de noms

source: inspect command failed
ca: ha fallat l'ordre d'inspecció

source: cannot print inspect result
ca: no es pot imprimir el resultat de la inspecció

source: failed to find the image of the currently running server container
ca: no s'ha pogut trobar la imatge del contenidor del servidor actualment en execució

source: Install a new server
ca: Instal·la un servidor nou

source: Install a new server on a kubernetes cluster
ca: Instal·la un servidor nou en un clúster de kubernetes

source: Install a new server on a kubernetes cluster The install command assumes the following: * kubectl and helm are installed locally * a working kubectl configuration should be set to connect to the cluster to deploy to The helm values file will be overridden with the values from the command parameters or configuration. NOTE: installing on a remote cluster is not supported yet!
ca: Instal·la un servidor nou en un clúster de kubernetes L'ordre install assumeix el següent: * El kubectl i el helm s'instal·len localment * s'ha d'establir una configuració de kubectl que funcioni per a connectar-se al clúster on desplegar El fitxer de valors del helm se sobreescriurà amb els valors dels paràmetres de l'ordre o de la configuració. NOTA: la instal·lació en un clúster remot encara no està suportada!

source: install %s before running this command
ca: instal·la %s abans d'executar aquesta ordre

source: cannot deploy certificate
ca: no es pot desplegar el certificat

source: cannot deploy uyuni
ca: no es pot desplegar uyuni

source: failed to stop service
ca: no s'ha pogut aturar el servei

source: error storing the SSL CA certificate in database
ca: s'ha produït un error en emmagatzemar el certificat SSL CA a la base de dades

source: Install a new server on podman
ca: Instal·la un servidor nou a podman

source: Install a new server on podman The install podman command assumes podman is installed locally. NOTE: installing on a remote podman is not supported yet!
ca: Instal·la un servidor nou a podman L'ordre install podman suposa que podman està instal·lat localment. NOTA: la instal·lació en un podman remot encara no està suportada!

source: Waiting for the server to start…
ca: S'està esperant que el servidor comenci…

source: cannot enable service
ca: no es pot activar el servei

source: failed to login to registry.suse.com
ca: no s'ha pogut iniciar la sessió a register.suse.com

source: Server is already initialized! Uninstall before attempting new installation or use upgrade command
ca: El servidor ja està inicialitzat! Desinstal·la abans d'intentar una nova instal·lació o utilitza l'ordre d'actualització

source: install podman before running this command
ca: instal·la podman abans d'executar aquesta ordre

source: Setting up the server with the FQDN '%s'
ca: S'està configurant el servidor amb el FQDN «%s»

source: failed to compute image URL
ca: no s'ha pogut calcular l'URL de la imatge

source: cannot wait for system start
ca: no es pot esperar a l'inici del sistema

source: Run setup command in the container
ca: Executa l'ordre de configuració al contenidor

source: Failed to stop service: %v
ca: No s'ha pogut aturar el servei: %v

source: failed to extract payg data
ca: no s'han pogut extreure les dades de pagament

source: cannot update SSL certificate
ca: no s'ha pogut actualitzar el certificat SSL

source: cannot enable podman socket
ca: no s'ha pogut habilitar el sòcol podman

source: Can only contain letters, digits . _ and -
ca: Només pot contenir lletres, dígits . _i -

source: Not a valid email address
ca: No és una adreça electrònica vàlida

source: Time zone to set on the server. Defaults to the host timezone
ca: Zona horària a establir al servidor. Per defecte a la zona horària de l'amfitrió

source: Administrator e-mail
ca: Correu electrònic de l'administrador

source: E-Mail sending the notifications
ca: Correu electrònic que envia les notificacions

source: InterServerSync v1 parent FQDN
ca: InterServerSync v1 pare FQDN

source: Database user
ca: Usuari de la base de dades

source: Database password. Randomly generated by default
ca: Contrasenya de la base de dades. Generat aleatòriament per defecte

source: Database name
ca: Nom de la base de dades

source: Database host
ca: Servidor de la base de dades

source: Database port
ca: Port de la base de dades

source: Database protocol
ca: Protocol de la base de dades

source: External database admin user name
ca: Nom d'usuari de l'administrador de la base de dades externa

source: External database admin password
ca: Contrasenya d'administrador de la base de dades externa

source: External database provider. Possible values 'aws'
ca: Proveïdor extern de bases de dades. Valors possibles 'aws'

source: Database Flags
ca: Banderes de la base de dades

source: Enable TFTP
ca: Habilita TFTP

source: Report database name
ca: Nom de la base de dades d'informes

source: Report database host
ca: Informa de l'amfitrió de la base de dades

source: Report database port
ca: Informe del port de la base de dades

source: Report Database username
ca: Nom d'usuari de la base de dades d'informes

source: Report database password. Randomly generated by default
ca: Informa de la contrasenya de la base de dades. Generat aleatòriament per defecte

source: Report DB Flags
ca: Indicadors de la BD

source: SSL certificate cnames separated by commas
ca: Cnames de certificat SSL separats per comes

source: SSL certificate country
ca: país del certificat SSL

source: SSL certificate state
ca: Estat del certificat SSL

source: SSL certificate city
ca: Ciutat del certificat SSL

source: SSL certificate organization
ca: Organització del certificat SSL

source: SSL certificate organization unit
ca: Unitat d'organització del certificat SSL

source: Password for the CA key to generate
ca: Contrasenya per a la clau de la CA a generar

source: SSL Certificate Flags
ca: Banderes de certificat SSL

source: Intermediate CA certificate path
ca: Camí intermedi del certificat de la CA

source: Root CA certificate path
ca: Camí del certificat CA arrel

source: Server certificate path
ca: Camí del certificat del servidor

source: Server key path
ca: Camí de la clau del servidor

source: 3rd Party SSL Certificate Flags
ca: Banderes de certificat SSL de 3a part

source: Enable tomcat and taskomatic remote debugging
ca: Habilita la depuració remota tomcat i taskomatic

source: Administrator user name
ca: Nom d'usuari de l'administrador

source: Administrator password
ca: Contrasenya de l'administrador

source: First name of the administrator
ca: Nom de l'administrador

source: Last name of the administrator
ca: Cognoms de l'administrador

source: First organization name
ca: Nom de la primera organització

source: First User Flags
ca: Primers indicadors d'usuari

source: Server appears to be already configured. Installation will continue, but installation options may be ignored.
ca: Sembla que el servidor ja està configurat. La instal·lació continuarà, però les opcions d'instal·lació es poden ignorar.

source: cannot copy /tmp/setup.sh
ca: no es pot copiar /tmp/setup.sh

source: error running the setup script
ca: s'ha produït un error en executar l'script de configuració

source: failed to add SSL CA certificate to host trusted certificates
ca: no s'ha pogut afegir el certificat SSL CA a l'amfitrió de certificats de confiança

source: unable to prepare API client
ca: no s'ha pogut preparar el client API

source: Server organization already exists, reusing
ca: L'organització del servidor ja existeix, es reutilitza

source: Administration user already exists, but organization %s could not be found
ca: L'usuari d'administració ja existeix, però no s'ha pogut trobar l'organització %s

source: Administration user already exists, but provided credentials are not valid
ca: L'usuari d'administració ja existeix, però les credencials proporcionades no són vàlides

source: Server set up, login on https://%[1]s with %[2]s user
ca: S'ha configurat el servidor, inicieu la sessió a https://%[1]s amb %[2]s d'usuari

source: Failed to generate setup script
ca: No s'ha pogut generar l'script de configuració

source: Migrate a remote server to containers running on a kubernetes cluster
ca: Migra un servidor remot a contenidors que s'executen en un clúster de kubernetes

source: Migrate a remote server to containers running on a kubernetes cluster This migration command assumes a few things: * the SSH configuration for the source server is complete, including user and all needed options to connect to the machine, * an SSH agent is started and the key to use to connect to the server is added to it, * kubectl and helm are installed locally, * a working kubectl configuration should be set to connect to the cluster to deploy to When migrating a server with a automatically generated SSL Root CA certificate, the private key password will be required to convert it to RSA in a kubernetes secret. This is not needed if the source server does not have a generated SSL CA certificate. NOTE: migrating to a remote cluster is not supported yet!
ca: Migra un servidor remot a contenidors que s'executen en un clúster de kubernetes Aquesta ordre de migració assumeix algunes coses: * la configuració SSH per al servidor d'origen és completa, incloent l'usuari i totes les opcions necessàries per connectar-se a la màquina, * s'inicia un agent SSH i s'hi afegeix la clau a utilitzar per connectar-se al servidor, * El kubectl i el helm s'instal·len localment, * s'ha d'establir una configuració de kubectl que funcioni per a connectar-se al clúster on desplegar En migrar un servidor amb un certificat SSL Root CA generat automàticament, la clau privada Es requerirà una contrasenya per a convertir-la a RSA en un secret de kubernetes. Això no és necessari si el servidor d'origen no té un certificat SSL CA generat. NOTA: la migració a un clúster remot encara no està suportada!

source: SSL CA generated private key password
ca: Contrasenya de clau privada generada per la CA SSL

source: failed to generate migration script
ca: no s'ha pogut generar l'script de migració

source: cannot run deploy
ca: no es pot executar el desplegament

source: cannot find node running uyuni
ca: no s'ha pogut trobar el node executant uyuni

source: cannot run migration
ca: no es pot executar la migració

source: cannot read data from container
ca: no es poden llegir les dades del contenidor

source: cannot set replicas to 0
ca: no s'han pogut establir les rèpliques a 0

source: Migration prepared. Run the 'migrate' command without '--prepare' to finish the migration.
ca: Migració preparada. Executeu l'ordre «migra» sense «--prepare» per a acabar la migració.

source: cannot setup SSL
ca: no s'ha pogut configurar SSL

source: The mirror data will not be migrated, ensure it is available at %s
ca: Les dades de la rèplica no seran migrades, assegureu-vos que estan disponibles a %s

source: cannot upgrade helm chart to image %s using new SSL certificate
ca: no es pot actualitzar el diagrama de helm a la imatge %s utilitzant un certificat SSL nou

source: cannot wait for deployment of %s
ca: no es pot esperar al desplegament de %s

source: cannot run PostgreSQL version upgrade script
ca: no s'ha pogut executar l'script d'actualització de la versió PostgreSQL

source: cannot run PostgreSQL finalisation script
ca: no s'ha pogut executar l'script de finalització PostgreSQL

source: cannot run post upgrade script
ca: no s'ha pogut executar l'script d'actualització

source: cannot upgrade to image %s
ca: no es pot actualitzar a la imatge %s

source: failed to strip text part from CA certificate
ca: no s'ha pogut suprimir la part de text del certificat de la CA

source: Migrate a remote server to containers
ca: Migra un servidor remot als contenidors

source: Migrate a remote server to containers running on podman
ca: Migra un servidor remot a contenidors que s'executen a podman

source: Migrate a remote server to containers running on podman This migration command assumes a few things: * the SSH configuration for the source server is complete, including user and all needed options to connect to the machine, * an SSH agent is started and the key to use to connect to the server is added to it, * podman is installed locally NOTE: migrating to a remote podman is not supported yet!
ca: Migra un servidor remot a contenidors que s'executen a podman Aquesta ordre de migració assumeix algunes coses: * la configuració SSH per al servidor d'origen és completa, incloent l'usuari i totes les opcions necessàries per connectar-se a la màquina, * s'inicia un agent SSH i s'hi afegeix la clau a utilitzar per connectar-se al servidor, * podman s'instal·la localment NOTA: la migració a un podman remot encara no està suportada!

source: cannot compute image
ca: no es pot calcular la imatge

source: cannot setup network
ca: no s'ha pogut configurar la xarxa

source: cannot run migration script
ca: no s'ha pogut executar l'script de migració

source: cannot run PostgreSQL finalize script
ca: no s'ha pogut executar l'script final PostgreSQL

source: cannot generate systemd service file
ca: no s'ha pogut generar el fitxer de servei systemd
