Repository: mbussolotto/uyuni-tools
Catalog: locale/mgradm/*.po
Languages: ca

source: cannot setup confidential computing attestation service
ca: no s'ha pogut configurar el servei de proves de computació confidencial

source: Enabling Hub XML-RPC API since it is enabled on the migrated server
ca: Habilitant l'API XML-RPC del Hub ja que està habilitada al servidor migrat

source: Server migrated
ca: Servidor migrat

source: Prepare the mgration - copy the data without stopping the source server.
ca: Prepareu la gració - copieu les dades sense aturar el servidor d'origen.

source: User on the source server. Non-root user must have passwordless sudo privileges (NOPASSWD tag in /etc/sudoers).
ca: Usuari en el servidor d'origen. L'usuari no arrel ha de tenir privilegis sudo sense contrasenya (etiqueta NOPASSWD a /etc/sudoers).

source: SSH_AUTH_SOCK is not defined, start an SSH agent and try again
ca: SSHAUTHSOCK no està definit, inicieu un agent SSH i torneu-ho a provar

source: Failed to find home directory to look for SSH config
ca: No s'ha pogut trobar el directori d'inici per a cercar la configuració SSH

source: built without kubernetes support
ca: s'ha construït sense suport per a kubernetes

source: Restart the server
ca: Reinicia el servidor

source: kubernetes not supported yet
ca: Els kubernetes encara no estan admesos

source: Multiple Hub XML-RPC container replicas are not currently supported.
ca: Actualment no s'admeten múltiples rèpliques de contenidors XML-RPC de Hub.

source: service not allowing to be scaled: %s
ca: el servei no permet escalar: %s

source: How many replicas of a service should be started.
ca: Quantes rèpliques d'un servei s'han d'iniciar.

source: Adjust the replicas for services supporting it.
ca: Ajusta les rèpliques dels serveis que ho suporten.

source: Adjust the replicas for services supporting it. Supported services: - uyuni-server-attestation - uyuni-hub-xmlrpc
ca: Ajusta les rèpliques dels serveis que ho suporten. Serveis suportats: - uyuni-server-attestation - uyuni-hub-xmlrpc

source: Start the server
ca: Inicia el servidor

source: failed to find the uyuni deployment namespace
ca: no s'ha pogut trobar l'espai de noms de desplegament uyuni

source: failed to get deployment status
ca: no s'ha pogut obtenir l'estat de desplegament

source: Some replicas are not ready: %[1]d / %[2]d
ca: Algunes rèpliques no estan preparades: %[1]d / %[2]d

source: the pod is not running
ca: el pod no s'està executant

source: failed to run spacewalk-service status
ca: no s'ha pogut executar l'estat del servei spacewalk

source: Get the server status
ca: Obtenir l'estat del servidor

source: no installed server detected
ca: no s'ha detectat cap servidor instal·lat

source: Stop the server
ca: Atura el servidor

source: Extract configuration and logs
ca: Extreu configuració i registres

source: Extract the host or cluster configuration and logs as well as those from the containers for support to help debugging.
ca: Extreu la configuració del servidor o del clúster i els registres, així com els de els contenidors de suport per ajudar a la depuració.

source: path where to extract the data
ca: camí on extreure les dades

source: Install a PTF or Test package on podman
ca: Instal·la un paquet PTF o Test a podman

source: Install a PTF or Test package on podman The support ptf podman command assumes podman is installed locally and the host machine is register to SCC. NOTE: for now installing on a remote podman is not supported!
ca: Instal·la un paquet PTF o Test a podman L'ordre de suport ptf podman assumeix que podman està instal·lat localment i la màquina amfitrió es registra a SCC. NOTA: per ara no s'admet la instal·lació en un podman remot!

source: ptf and test flags cannot be set simultaneously
ca: ptf i indicadors de prova no es poden establir simultàniament

source: ptf and test flags cannot be empty simultaneously
ca: ptf i les banderes de prova no poden estar buides simultàniament

source: user flag cannot be empty
ca: l'indicador d'usuari no pot estar buit

source: failed to find server image
ca: no s'ha pogut trobar la imatge del servidor

source: The computed image is %s
ca: La imatge calculada és %s

source: The computed confidential computing image is %s
ca: La imatge de càlcul confidencial calculada és %s

source: The computed hub XML-RPC API image is %s
ca: La imatge API XML-RPC del hub calculat és %s

source: Install a PTF
ca: Instal·la un PTF

source: unable to get random file prefix
ca: no s'ha pogut obtenir el prefix de fitxer aleatori

source: unable to cleanup source file
ca: no s'ha pogut netejar el fitxer font

source: output file %s exists, use -f to force overwrite
ca: el fitxer de sortida %s existeix, useu -f per forçar la sobreescriptura

source: interactive mode cannot work with a file output
ca: el mode interactiu no pot funcionar amb una sortida de fitxer

source: unknown or unsupported database %s
ca: base de dades desconeguda o no suportada %s

source: Command failed
ca: Ha fallat l'ordre

source: Result is stored in the file '%s'
ca: El resultat s'emmagatzema al fitxer '%s'

source: cannot write
ca: no es pot escriure

source: Execute SQL query
ca: Executa una consulta SQL

source: Execute SQL query either provided in sql-file or passed through standard input. Examples: Run the 'select hostname from rhnserver;' query using echo: # echo 'select hostname from rhnserver;' | mgradm support sql Run in interative mode: # mgradm support sql -i Running the SQL queries in example.sql file and output them to out.log file # mgradm support sql example.sql -o out.log
ca: Executeu la consulta SQL ja sigui proporcionada en el fitxer sql o passada a través de l'entrada estàndard. Exemples: Executeu la consulta «selecciona el nom de l'ordinador des del rhnserver;» usant l'eco: echo 'select hostname from rhnserver;' mgradm support sql Executa en mode interatiu: mgradm suporta sql -i S'estan executant les consultes SQL al fitxer example.sql i se'ls ha enviat a un fitxer out.log support mgradm admet sql example.sql -o out.log

source: Target database, can be 'reportdb' or 'productdb'
ca: Base de dades objectiu, pot ser «reportdb» o «productdb»

source: Start in interactive mode
ca: Inicia en mode interactiu

source: Force overwrite of output file if already exists
ca: Força la sobreescriptura del fitxer de sortida si ja existeix

source: Write output to the file instead of standard output
ca: Escriu la sortida al fitxer en lloc de la sortida estàndard

source: Commands for support operations
ca: Ordres per a operacions de suport

source: --purge-volumes is ignored on a kubernetes deployment
ca: --purge-volumes s'ignora en un desplegament de kubernetes

source: --purge-images is ignored on a kubernetes deployment
ca: --purge-images s'ignora en un desplegament de kubernetes

source: Would run %s
ca: S'executaria %s

source: Failed deleting config map
ca: Ha fallat en suprimir el mapa de configuració

source: Failed deleting secret
ca: Ha fallat en suprimir el secret

source: Nothing has been uninstalled, run with --force to actually uninstall
ca: No s'ha desinstal·lat res, executeu amb --force per a desinstal·lar

source: Volumes have not been touched. Depending on the storage class used, they may not have been removed
ca: No s'han tocat els volums. Depenent de la classe d'emmagatzematge utilitzada, és possible que no s'hagin eliminat

source: Failed to remove volume %s
ca: No s'ha pogut eliminar el volum %s

source: All volumes have been removed
ca: S'han suprimit tots els volums

source: Some volumes have not been removed completely
ca: Alguns volums no s'han eliminat completament

source: cannot delete image %s
ca: no es pot suprimir la imatge %s

source: All images have been removed
ca: S'han eliminat totes les imatges

source: Nothing has been uninstalled, run with --force and --purge-volumes to actually uninstall and clear data
ca: No s'ha desinstal·lat res, executeu amb --force i --purge-volumes per a desinstal·lar i netejar dades

source: Data have been kept, use podman volume commands to clear the volumes
ca: S'han mantingut les dades, utilitzeu ordres de volum podman per netejar els volums

source: Uninstall a server
ca: Desinstal·la un servidor

source: Uninstall a server and optionally the corresponding volumes. By default it will only print what would be done, use --force to actually remove.
ca: Desinstal·la un servidor i opcionalment els volums corresponents. Per defecte només imprimirà el que es faria, utilitzeu --force per eliminar-lo.

source: Upgrade a local server on kubernetes
ca: Actualitza un servidor local al kubernetes

source: Upgrade a local server on podman
ca: Actualitza un servidor local a podman

source: List available tags for an image
ca: Llista d'etiquetes disponibles per a una imatge

source: failed to unmarshall configuration
ca: no s'ha pogut desfer la configuració del «marshall»

source: Upgrade local server
ca: Actualitza el servidor local

source: Setting up confidential computing attestation service
ca: Configuració del servei de certificació informàtica confidencial

source: failed to generate systemd service unit file
ca: no s'ha pogut generar el fitxer de la unitat de servei del systemd

source: cannot generate systemd conf file
ca: no s'ha pogut generar el fitxer conf del systemd

source: No changes requested for hub. Keep %d replicas.
ca: No s'han sol·licitat canvis al hub. Mantén %d rèpliques.

source: cannot generate systemd service
ca: no s'ha pogut generar el servei systemd

source: Multiple Hub XML-RPC container replicas are not currently supported, setting up only one.
ca: Actualment no s'admeten múltiples rèpliques de contenidors XML-RPC de Hub, configurant-ne només una.

source: Creating SSL server certificate secret
ca: S'està creant el secret del certificat del servidor SSL

source: Failed to generate uyuni-crt secret definition
ca: No s'ha pogut generar la definició secreta uyuni-crt

source: Failed to create uyuni-crt TLS secret
ca: No s'ha pogut crear el secret uyuni-crt TLS

source: cannot install cert manager
ca: no s'ha pogut instal·lar el gestor de certificats

source: Creating SSL certificate issuer
ca: S'està creant l'emissor de certificats SSL

source: failed to generate issuer definition
ca: no s'ha pogut generar la definició de l'emissor

source: Failed to create issuer
ca: No s'ha pogut crear l'emissor

source: Issuer didn't turn ready after 60s
ca: L'emissor no es va posar a punt després dels anys 60

source: Installing cert-manager
ca: S'està instal·lant el gestor de certificats

source: cannot run helm upgrade
ca: no es pot executar l'actualització del helm

source: cannot deploy
ca: no es pot desplegar

source: Extracting CA certificate to a configmap
ca: S'està extraient el certificat CA a un mapa de configuració

source: CA cert: %s
ca: Cert de la CA: %s

source: uyuni-ca configmap already existing, skipping extraction
ca: el mapa de configuració uyuni-ca ja existeix, s'omet l'extracció

source: Failed to get uyuni-ca certificate
ca: No s'ha pogut obtenir el certificat uyuni-ca

source: Failed to base64 decode CA certificate
ca: No s'ha pogut descodificar el certificat CA en base64

source: Failed to create uyuni-ca config map from certificate
ca: No s'ha pogut crear el mapa de configuració uyuni-ca a partir del certificat

source: cannot upgrade
ca: no es pot actualitzar

source: cannot install cert-manager and self-sign issuer
ca: no s'ha pogut instal·lar el gestor de certificats i l'emissor d'autosignació

source: Installing Uyuni
ca: Instal·lació d'Uyuni

source: cannot inspect kubernetes values
ca: no es poden inspeccionar els valors del kubernetes

source: inspect function did non return fqdn value
ca: la funció inspect no retorna el valor fqdn

source: cannot set replica to 0
ca: no es pot establir la rèplica a 0

source: Previous PostgreSQL is %[1]s, new one is %[2]s. Performing a DB version upgrade…
ca: Previous PostgreSQL és %[1]s, nou és %[2]s. S'està realitzant una actualització de la versió DB…

source: Upgrading to %s without changing PostgreSQL version
ca: S'està actualitzant a %s sense canviar la versió PostgreSQL

source: trying to downgrade PostgreSQL from %[1]s to %[2]s
ca: s'està intentant desactualitzar PostgreSQL de %[1]s a %[2]s

source: Using database upgrade image %s
ca: Utilitzant la imatge d'actualització de la base de dades %s

source: cannot generate PostgreSQL database version upgrade script
ca: no s'ha pogut generar l'script d'actualització de la versió de la base de dades PostgreSQL

source: cannot delete %s
ca: no es pot suprimir %s

source: error running container %s
ca: s'ha produït un error en executar el contenidor %s

source: cannot generate PostgreSQL finalization script
ca: no s'ha pogut generar l'script de finalització PostgreSQL

source: Enabling system service
ca: S'està habilitant el servei del sistema

source: cannot generate systemd user configuration file
ca: no s'ha pogut generar el fitxer de configuració de l'usuari del sistema

source: failed to create temporary folder on container to copy certificates to
ca: no s'ha pogut crear la carpeta temporal al contenidor per a copiar els certificats

source: failed to update SSL certificate: %s
ca: no s'ha pogut actualitzar el certificat SSL: %s

source: failed to remove copied certificate files in the container
ca: no s'han pogut eliminar els fitxers de certificat copiats al contenidor

source: failed to remove now useless ssl-build folder in the container
ca: no s'ha pogut eliminar la carpeta «ssl-build» inútil al contenidor

source: Restarting services after updating the certificate
ca: S'estan reiniciant els serveis després d'actualitzar el certificat

source: cannot generate migration script
ca: no s'ha pogut generar l'script de migració

source: Migrating server
ca: S'està migrant el servidor

source: cannot run uyuni migration container
ca: no es pot executar el contenidor de migració uyuni

source: cannot inspect volume %s
ca: no es pot inspeccionar el volum %s

source: cannot restore %s SELinux permissions
ca: no es poden restaurar %s permisos de SELinux

source: cannot read extracted data
ca: no es poden llegir les dades extretes

source: cannot inspect podman values
ca: no es poden inspeccionar els valors de podman

source: cannot stop service
ca: no es pot aturar el servei

source: Previous postgresql is %[1]s, instead new one is %[2]s. Performing a DB version upgrade…
ca: El postgresql anterior és %[1]s, en canvi el nou és %[2]s. S'està realitzant una actualització de la versió DB…

source: error upgrading confidential computing service.
ca: s'ha produït un error en actualitzar el servei informàtic confidencial.

source: cannot inspect data
ca: no es poden inspeccionar les dades

source: The above error is only relevant if using a public cloud provider registry
ca: L'error anterior només és rellevant si s'utilitza un registre públic de proveïdors de núvols

source: Failed to find a non-CA certificate
ca: No s'ha pogut trobar un certificat que no sigui de l'AC

source: expected to find a certificate, got none
ca: s'esperava trobar un certificat, no s'ha obtingut

source: Failed to read certificate file %s
ca: No s'ha pogut llegir el fitxer de certificat %s

source: Failed to extract data from certificate
ca: No s'han pogut extreure les dades del certificat

source: Failed to parse start date: %s
ca: No s'ha pogut analitzar la data d'inici: %s

source: Failed to parse end date: %s
ca: No s'ha pogut analitzar la data de finalització: %s

source: No CA found
ca: No s'ha trobat cap CA

source: No CA found for server certificate
ca: No s'ha trobat cap CA per al certificat del servidor

source: Missing CA with subject hash %s
ca: Falta la CA amb el resum de l'assumpte %s

source: server certificate is required
ca: es requereix el certificat del servidor

source: server key is required
ca: es requereix la clau del servidor

source: %s file is not accessible
ca: El fitxer %s no és accessible

source: Source server SSL CA private key password
ca: Contrasenya de la clau privada de la CA del servidor d'origen

source: Failed to convert CA private key to RSA
ca: No s'ha pogut convertir la clau privada CA a RSA

source: Server certificate, key and root CA need to be all provided
ca: El certificat del servidor, la clau i l'arrel de la CA han de ser tots proporcionats

source: Kubernetes namespace where to install uyuni
ca: Espai de noms Kubernetes on instal·lar uyuni

source: URL to the uyuni helm chart
ca: URL al diagrama del timó uyuni

source: Version of the uyuni helm chart
ca: Versió de la taula de comandaments uyuni

source: Path to a values YAML file to use for Uyuni helm install
ca: Camí a un fitxer YAML de valors que s'utilitzarà per a la instal·lació del helm d'Uyuni

source: Kubernetes namespace where to install cert-manager
ca: Espai de noms del Kubernetes on instal·lar el gestor de certificats

source: URL to the cert-manager helm chart. To be used for offline installations
ca: URL al diagrama de helm del gestor de certificats. S'utilitzarà per a instal·lacions fora de línia

source: Version of the cert-manager helm chart
ca: Versió de la llista de helms de cert-manager

source: Path to a values YAML file to use for cert-manager helm install
ca: Camí a un fitxer YAML de valors que s'utilitzarà per a la instal·lació del helm del gestor de certificats

source: Helm Chart Flags
ca: Banderes del diagrama Helm

source: Image for %s container
ca: Imatge per al contenidor %s

source: Tag for %s container, overrides the global value if set
ca: Etiqueta per al contenidor %s, anul·la el valor global si s'estableix

source: SUSE Customer Center username. It will be used as SCC credentials for products synchronization and to pull images from registry.suse.com
ca: Nom d'usuari del Centre de Clients SUSE. S'utilitzarà com a credencials SCC per a la sincronització de productes i per extreure imatges de register.suse.com

source: SUSE Customer Center password. It will be used as SCC credentials for products synchronization and to pull images from registry.suse.com
ca: Contrasenya del Centre de Clients SUSE. S'utilitzarà com a credencials SCC per a la sincronització de productes i per extreure imatges de register.suse.com

source: SUSE Customer Center Flags
ca: Banderes del Centre de Clients SUSE

source: Image
ca: Imatge

source: Specify a registry where to pull the images from
ca: Especifiqueu un registre d'on treure les imatges

source: Tag Image
ca: Imatge de l'etiqueta

source: Image Flags
ca: Banderes d'imatge

source: Database upgrade image
ca: Imatge d'actualització de la base de dades

source: Database upgrade image tag
ca: Etiqueta d'imatge d'actualització de la base de dades

source: Database Upgrade Image Flags
ca: Actualitza els indicadors d'imatge de la base de dades

source: Path to mirrored packages mounted on the host
ca: Camí als paquets reflectits muntats a l'amfitrió

source: Confidential Computing Flags
ca: Banderes de Computació Confidencial

source: confidential computing attestation
ca: certificat de computació confidencial

source: How many replicas of the confidential computing container should be started
ca: Quantes rèpliques del contenidor de càlcul confidencial s'han d'iniciar

source: How many replicas of the confidential computing container should be started. Leave it unset if you want to keep the previous number of replicas.
ca: Quantes rèpliques del contenidor informàtic confidencial s'han d'iniciar. Deixeu-lo sense establir si voleu mantenir el nombre anterior de rèpliques.

source: Hub XML-RPC API
ca: API XML-RPC del Hub

source: How many replicas of the Hub XML-RPC API service container should be started.
ca: Quantes rèpliques del contenidor de serveis API de Hub XML-RPC s'han d'iniciar.

source: How many replicas of the Hub XML-RPC API service container should be started. Leave it unset if you want to keep the previous number of replicas.
ca: Quantes rèpliques del contenidor de serveis API de Hub XML-RPC s'han d'iniciar. Deixeu-lo sense establir si voleu mantenir el nombre anterior de rèpliques.

source: exec command failed
ca: ha fallat l'ordre exec

source: failed to generate %s
ca: no s'ha pogut generar %s

source: error running the migration script
ca: s'ha produït un error en executar l'script de migració

source: Image is: %s
ca: La imatge és: %s

source: cannot check server release
ca: no es pot comprovar la versió del servidor

source: currently SUSE Manager %s is installed, instead the image is Uyuni. Upgrade is not supported
ca: Actualment s'instal·la el gestor SUSE %s, en lloc d'això la imatge és Uyuni. No s'admet l'actualització

source: currently Uyuni %s is installed, instead the image is SUSE Manager. Upgrade is not supported
ca: Actualment Uyuni %s està instal·lat, en lloc d'això la imatge és SUSE Manager. No s'admet l'actualització

source: failed to read current uyuni release
ca: no s'ha pogut llegir la versió actual de l'uyuni

source: cannot fetch release from image %s
ca: no es pot obtenir la publicació de la imatge %s

source: cannot downgrade from version %[1]s to %[2]s
ca: no es pot revertir de la versió %[1]s a %[2]s

source: failed to read current susemanager release
ca: no s'ha pogut llegir la versió actual del gestor de usos

source: cannot fetch postgresql version from %s
ca: no es pot obtenir la versió postgresql de %s

source: posgresql is not installed in the current deployment
ca: posgresql no està instal·lat en el desplegament actual

source: cannot find either /etc/uyuni-release or /etc/susemanagere-release
ca: no es pot trobar /etc/uyuni-release o /etc/susemanagere-release
