Repository: mbussolotto/uyuni-tools
Catalog: locale/mgrctl/*.po
Languages: fr

source: JSON over HTTP API helper tool
fr: Utilitaire pour l'API JSON sur HTTP

source: Call API GET request
fr: Appeler une requête API GET

source: Takes an API path and optional parameters and then issues GET request with them. If user and password are provided, calls login before API call
fr: Effectue une requête GET avec un chemin d'API et des paramètres optionnels. Appelle login avant la requête de l'API si l'utilisateur et le mot de passe sont fournis

source: Call API POST request
fr: Appeler une requête API POST

source: Takes an API path and parameters and then issues POST request with them. User and password are mandatory. Parameters can be either JSON encoded string or one or more key=value pairs.
fr: Effectue une requête POST avec un chemin d'API et des paramètres. L'utilisateur et le mot de passe sont obligatoires. Les paramètres peuvent être soit une chaîne de caractères encodée en JSON ou une ou plusieurs paire clé=valeur.

source: unable to login to the server: %s
fr: impossible de se connecter au serveur: %s

source: error in query %s: %s
fr: erreur dans la requête %s: %s

source: Uyuni control tool
fr: Outil de contrôle d'Uyuni

source: Tool to help managing Uyuni servers mainly through their API
fr: Outil pour aider à gérer des serveurs Uyuni, principalement via leur API

source: configuration file path
fr: chemin vers le fichier de configuration

source: application log level
fr: niveau de verbosité de l'application

source: Welcome to %s
fr: Bienvenue à %s

source: Executing command: %s
fr: Exécution de la commande: %s

source: Failed to create api command
fr: Echec lors de la création de la commande api

source: Failed to create org command
fr: Echec lors de la création de la commande org

source: Copy files to and from the containers
fr: Copie des fichiers vers et depuis les conteneurs

source: Takes a source and destination parameters. One of them can be prefixed with 'server:' to indicate the path is within the server pod.
fr: Prend une source et une destination comme paramètres. L'un d'eux peut être préfixé par 'server:' pour indiquer que le chemin est dans le conteneur du serveur.

source: failed to unmarshall configuration
fr: impossible d'analyser la configuration

source: User or UID to set on the destination file
fr: Utilisateur ou UID à définir sur le fichier de destination

source: Group or GID to set on the destination file
fr: Groupe ou GID à définir sur le fichier de destination

source: Execute commands inside the uyuni containers using 'sh -c'
fr: Exécute des commandes à l'intérieur des conteneurs uyuni avec 'sh -c'

source: environment variables to pass to the command, separated by commas
fr: variables d'environnement à passer à la commade, séparées par des virgules

source: Pass stdin to the container
fr: Passer l'entrée standard au conteneur

source: Stdin is a TTY
fr: L'entrée standard est un TTY

source: Command failed
fr: La commande a échoué

source: Command returned with exit code 0
fr: La commande a été exécutée avec un code de retour de 0

source: cannot write: %s
fr: impossible d'écrire: %s

source: Running: %s %s
fr: Exécution: %s %s

source: Organization-related commands
fr: Commandes liées à l'organisation

source: Create the first user and organization
fr: Créer les premiers utilisateurs et organisations

source: Administrator user name
fr: Nom d'utilisateur de l'administrateur

source: Administrator password
fr: Mot de passe de l'administrateur

source: The first name of the administrator
fr: Le prénom de l'administrateur

source: The last name of the administrator
fr: Le nom de l'administrateur

source: The administrator's email
fr: L'adresse email de l'administrateur

source: The first organization name
fr: Le nom de la première organisation

source: Organization %s created with id %d
fr: Organisation %s créée avec l'id %d

source: Run a terminal inside the server container
fr: Exécuter un terminal dans le conteneur du serveur
